TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/гкс_ПриемкаТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_ПриемкаТранспорта</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СостоянияРегистрации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МестнаяДата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СтатусыДопускаВагоновКВскрытию/гкс_СтатусыДопускаВагоновКВскрытию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СтатусыДопускаВагоновКВскрытию</name>
  <comment>ERP-2051</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВскрытиеЗапрещено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вагон</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопускКВскрытию</name>
    <type>
      <types>EnumRef.гкс_ДопускиКВскрытиюВагонов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/гкс_СвязьРегистрацииИТранспортногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СвязьРегистрацииИТранспортногоДокумента</name>
  <comment>Транспортные документы регистрации</comment>
  <resources>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ПриемкаТранспортаБезВходногоКонтроля/гкс_ПриемкаТранспортаБезВходногоКонтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ПриемкаТранспортаБезВходногоКонтроля</name>
  <resources>
    <name>ПроизводственныеСутки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ФактическиеПоказателиКачества/гкс_ФактическиеПоказателиКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ФактическиеПоказателиКачества</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоответствуетНормативу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтклонятьКачество</name>
    <comment>При отклонении от нормы - отклонять качество</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УсиленныйКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеКачества</name>
    <type>
      <types>EnumRef.гкс_СостоянияКачества</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоЗначениеВнешнейПробы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаАнализа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрацияНаПЛК</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользованияКачества</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаТС</name>
    <type>
      <types>CatalogRef.гкс_ГруппыТС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыПроб/гкс_ТипыПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыПроб</name>
  <enumValues>
    <name>Единичная</name>
  </enumValues>
  <enumValues>
    <name>Композитная</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияРегистрации/гкс_СостоянияРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияРегистрации</name>
  <enumValues>
    <name>Прибыл</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенБрутто</name>
  </enumValues>
  <enumValues>
    <name>НеПринятоПоПревышениюМаксимальногоВеса</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОтборуПроб</name>
  </enumValues>
  <enumValues>
    <name>ВзятыПробы</name>
  </enumValues>
  <enumValues>
    <name>РезультатыПробПолучены</name>
  </enumValues>
  <enumValues>
    <name>КачествоПринято</name>
  </enumValues>
  <enumValues>
    <name>КачествоНеПринято</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаРазрешена</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>ВзвешенТара</name>
  </enumValues>
  <enumValues>
    <name>Убыл</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>ПринятыПробы</name>
  </enumValues>
  <enumValues>
    <name>ПогрузкаРазрешена</name>
    <comment>ERP-2029</comment>
  </enumValues>
  <enumValues>
    <name>Погружен</name>
    <comment>ERP-2029</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыВзвешивания/гкс_ТипыВзвешивания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыВзвешивания</name>
  <enumValues>
    <name>Въезд</name>
  </enumValues>
  <enumValues>
    <name>Выезд</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипРегистрации/гкс_ТипРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипРегистрации</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
// 	КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_СкладскаяРасписка";
	КомандаПечати.Представление = НСтр("ru = 'Складская расписка'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать
//  ПараметрыПечати - Структура - дополнительные настройки печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение ссылка на объект
//                                            представление имя области, в которой был выведен объект (выходной параметр)
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр)
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СкладскаяРасписка") Тогда
		ТабличныйДокумент = ПечатьСкладскойРасписки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_СкладскаяРасписка", 
			НСтр("ru = 'Макет складской расписки'"), ТабличныйДокумент);
	КонецЕсли;

КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

// Групповое изменение реквизитов Регистрации из АРМ.
//
// Параметры:
//   ПараметрыЗаполнения - Структура
//
Процедура ГрупповоеИзменениеРегистраций(Знач ПараметрыЗаполнения) Экспорт
	
	ЗначенияЗаполнения = Новый Структура;		
	Если ПараметрыЗаполнения.Свойство("Номенклатура") Тогда
		ЗначенияЗаполнения.Вставить("Номенклатура", ПараметрыЗаполнения.Номенклатура);
	КонецЕсли;
		
	Если ПараметрыЗаполнения.Свойство("Комментарий") Тогда
		ЗначенияЗаполнения.Вставить("Комментарий", ПараметрыЗаполнения.Комментарий);
	КонецЕсли;
	
	Для Каждого ДокументРегистрация Из ПараметрыЗаполнения.ВыбранныеРегистрации Цикл	
		Документы.гкс_РегистрацияНаПЛК.ИзменитьРеквизитыДокумента(ДокументРегистрация, ЗначенияЗаполнения);	
	КонецЦикла;
	
КонецПроцедуры

// Групповое создание номеров проб.
// 
// Параметры:
//  ЗначенияЗаполнения - Структура - Значения заполнения
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - массив документов к обработке
//
Процедура ГрупповоеСозданиеНомеровПроб(Знач ЗначенияЗаполнения, ВыбранныеРегистрации) Экспорт

	МенеджерОбъекта = Документы.гкс_ФормированиеНомераПробы;
	
	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл
		
		ДокументФормированиеНомераПробы = МенеджерОбъекта.ДокументПоРегистрацииТипуПробы(
			ДокументРегистрации, Перечисления.гкс_ТипыПроб.Единичная); 
			
		Если Не ЗначениеЗаполнено(ДокументФормированиеНомераПробы) Тогда
			
			ЗначенияЗаполнения.Вставить("ДокументРегистрации", 	ДокументРегистрации);
		    // Попытка
			Документы.гкс_ФормированиеНомераПробы.СоздатьНовыйДокумент(ЗначенияЗаполнения);

		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

// Групповое направление на разгрузку.
// 
// Параметры:
//  ЗначенияЗаполнения - Структура - Значения заполнения
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - массив документов к обработке
//
Процедура ГрупповоеНаправлениеНаРазгрузку(Знач ЗначенияЗаполнения, ВыбранныеРегистрации) Экспорт
		
	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл
				
		Состояние = РегистрыСведений.гкс_СостоянияРегистрации.ТекущееСостояниеПоРегистрации(ДокументРегистрации);		
		ЭтоРезультатыПробПолучены = Перечисления.гкс_СостоянияРегистрации.ЭтоРезультатыПробПолучены(Состояние);		
			
		Если ЭтоРезультатыПробПолучены И Не ЗначенияЗаполнения.ПринятьКачество Тогда	
			Продолжить;
		КонецЕсли;
			
		РезультатБлокировки = гкс_ВходнойКонтрольКачества
			.ПроверитьБлокировкуДляСозданияНнР(ДокументРегистрации);
		Если РезультатБлокировки.ЕстьБлокировка Тогда
			Продолжить;
		КонецЕсли;
				
		ЗначенияЗаполнения.Вставить("Дата", ТекущаяДатаСеанса());
		
		МестнаяДата = ПолучитьМестнуюДату(ЗначенияЗаполнения.ТочкаМаршрута);	
		ЗначенияЗаполнения.Вставить("МестнаяДата", МестнаяДата);
		
		ЗначенияЗаполнения.Вставить("ДокументРегистрации", ДокументРегистрации);
		ЗначенияЗаполнения.Вставить("ТочкаМаршрута", ЗначенияЗаполнения.ТочкаМаршрута);
		ЗначенияЗаполнения.Вставить("ПервичныйСтатус", Состояние); 
		
		НаправлениеНаРазгрузку = Документы.гкс_НаправлениеНаРазгрузку.ПолучитьПоРегистрации(ДокументРегистрации);
			
		Документы.гкс_НаправлениеНаРазгрузку.
				СоздатьИзменитьИзАРМПриемки(ЗначенияЗаполнения, 
				ЗначениеЗаполнено(НаправлениеНаРазгрузку), НаправлениеНаРазгрузку);
		
	КонецЦикла;
	
КонецПроцедуры

// Зарегистрировать пропуcк контроля качества для документов из массива.
// 
// Параметры:
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - массив документов к обработке
//
Процедура ЗарегистрироватьПропуcкКонтроляКачества(Знач ВыбранныеРегистрации) Экспорт

	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл
				
		НачатьТранзакцию();
		Попытка
			
			// 1. Записать новое состояние в РС "гкс_СостоянияРегистрации" 
			// 2. Записать новое состояние в РС "АРМПриемкиНаПЛКСписокРегистраций"
			гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(ДокументРегистрации, 
				Перечисления.гкс_СостоянияРегистрации.КачествоПринято);

			// 3. Записать в новый РС "Приемка без входного контроля"
			гкс_ПриемкаТранспорта.ЗаписатьРегистрПриемкиБезВходногоКонтроля(ДокументРегистрации);
			
			//4. Создать направление на разгрузку с автоопределением силоса.
			гкс_ПриемкаТранспорта.СоздатьНаправлениеНаРазгрузкуПриПропускеКонтроля(ДокументРегистрации);
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ТекстОшибки = НСтр("ru='Невозможно изменить состояние регистрации %1 Повторите попытку'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ДокументРегистрации);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Зарегистрировать новое состояние для документов из массива.
// 
// Параметры:
//  ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - массив документов к обработке
//  Состояние - ПеречислениеСсылка.гкс_СостоянияРегистрации - новое состояние регистрации
//
Процедура ЗарегистрироватьНовоеСостояниеПоСписку(Знач ВыбранныеРегистрации, Состояние) Экспорт

	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл
				
		НачатьТранзакцию();
		Попытка
			гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(ДокументРегистрации, Состояние);
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ТекстОшибки = НСтр("ru='Невозможно изменить состояние регистрации %1 Повторите попытку'");
			ТекстОшибки = СтрШаблон(ТекстОшибки, ДокументРегистрации);
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Групповое изменение допусков вагонов.
//
// Параметры:
//   ЗначенияЗаполнения - Структура - данные заполнения
//   
//   ВыбранныеРегистрации - Массив из ДокументСсылка.гкс_РегистрацияНаПЛК - ссылки обрабатываемых документов
//
Процедура ГрупповоеИзменениеДопусков(ЗначенияЗаполнения, ВыбранныеРегистрации) Экспорт
		
	Для Каждого ДокументРегистрации Из ВыбранныеРегистрации Цикл	
			
		// Дополним параметры доступа значениями для регистрации
		Вагон = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРегистрации, "ТранспортноеСредство");
	  	ЗначенияЗаполнения.Вставить("Вагон", Вагон);
		ЗначенияЗаполнения.Вставить("ДокументРегистрации", ДокументРегистрации);
					
		Попытка
		
			РегистрыСведений.гкс_СтатусыДопускаВагоновКВскрытию.ЗарегистрироватьИзменениеДопуска(ЗначенияЗаполнения);
			
			ЕстьДопускПоКонтролямСтатусов = гкс_ПриемкаТранспорта.ЕстьДопускПоКонтролямСтатусов(ДокументРегистрации);
			ТекущееСостояние = гкс_ПриемкаТранспорта.ТекущееСостояниеРегистрации(ДокументРегистрации);
		
			Если  ТекущееСостояние = Перечисления.гкс_СостоянияРегистрации.ВзвешенБрутто 
				И ЕстьДопускПоКонтролямСтатусов Тогда
				
				Если ПолучитьФункциональнуюОпцию("гкс_ИспользоватьОтключениеВходногоКонтроляКачества") 
					И  ПропускатьВходнойКонтроль(ДокументРегистрации) Тогда
					
					гкс_ПриемкаТранспорта.СоздатьНаправлениеНаРазгрузкуПриПропускеКонтроля(ДокументРегистрации);
					СостоянияРегистрации = ПолучитьСостоянияРегистрации(ДокументРегистрации);
					
				Иначе
					СостоянияРегистрации = Перечисления.гкс_СостоянияРегистрации.ГотовКОтборуПроб;
				КонецЕсли;
				
				гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(ДокументРегистрации, СостоянияРегистрации, 
					ЗначенияЗаполнения.Комментарий);
				
			КонецЕсли;
				
		Исключение

			ТекстОшибки = СтрШаблон(НСтр("ru = 'Не изменить допуск %1. %2'"), 
				ДокументРегистрации, ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДокументРегистрации); 
			
			ЗаписьЖурналаРегистрации("СтатусыДопускаВагоновКВскрытию.Запись", 
								УровеньЖурналаРегистрации.Ошибка,
								Метаданные.РегистрыСведений.гкс_СтатусыДопускаВагоновКВскрытию, , 
								ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Формирует структуру для заполнения детальных записей на форме.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - Документ регистрации для получения данных.
//  ДокументРегистрацииАнализов - ДокументСсылка.гкс_ЛабораторныйАнализ - Документ регистрации анализов
// 
// Возвращаемое значение:
//  Структура - Данные для детальных записей:
// 		* ДанныеРегистрации - Структура - 
// 		* КачественныеПоказатели - ТаблицаЗначений, ДеревоЗначений -
//		* ТранспортныйДокумент - ДокументСсылка.гкс_ТранспортныйДокумент
//		* ЗаявкаНаПеревозку - ДокументСсылка.гкс_ЗаявкаНаПеревозку
//
Функция ДанныеДляДетальныхЗаписей(ДокументРегистрации, ДокументРегистрацииАнализов) Экспорт
	
	Результат = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДанныеДляДетальныхЗаписей();
	
	Запрос.УстановитьПараметр("Ссылка", ДокументРегистрации);
	Запрос.УстановитьПараметр("СсылкаАнализов", ДокументРегистрацииАнализов);
	
	Запрос.УстановитьПараметр("ИспользоватьУсиленныйКонтроль", 
		ПолучитьФункциональнуюОпцию("гкс_ИспользоватьУсиленныйКонтрольКачества"));
		
	ПакетныйРезультат	= Запрос.ВыполнитьПакет();
	
	// Индексы результатов пакетного запроса
	ИндексЗапросаДанныеРегистрации 		= 0;
	ИндексЗапросаКачественныеПоказатели	= 1;
		
	ДанныеРегистрацииВТаблице = ПакетныйРезультат[ИндексЗапросаДанныеРегистрации].Выгрузить();
	Результат.Вставить("ДанныеРегистрации", 
		ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ДанныеРегистрацииВТаблице[0]));
		
	Результат.Вставить("КачественныеПоказатели", 
		ПакетныйРезультат[ИндексЗапросаКачественныеПоказатели].Выгрузить());
			
	ИнформацияОТранспортномДокументе = гкс_ПриемкаТранспортаВызовСервера.
		ИнформацияОТранспортеПоРегистрации(ДокументРегистрации);
				
	Если ИнформацияОТранспортномДокументе <> Неопределено Тогда  
		Результат.Вставить("ТранспортныйДокумент", ИнформацияОТранспортномДокументе.ТранспортныйДокумент);
		Результат.Вставить("ЗаявкаНаПеревозку", гкс_ПриемкаТранспорта.ЗаявкаНаПеревозкуПоТранспортномуДокументу(
			ИнформацияОТранспортномДокументе.ТранспортныйДокумент, Результат.ДанныеРегистрации.ТранспортноеСредство));
	Иначе
		Результат.Вставить("ТранспортныйДокумент", Документы.гкс_ТранспортныйДокумент.ПустаяСсылка());
		Результат.Вставить("ЗаявкаНаПеревозку", Документы.гкс_ЗаявкаНаПеревозку.ПустаяСсылка());	
	КонецЕсли;
			
	Возврат Результат;
	
КонецФункции

// Формирует транспортный документ и основание движения запасов при установлении состояния "убыл"
//
// Параметры:
//  ДокументРегистрации  - ДокументСсылка.гкс_РегистрацияНаПЛК - документ регистрации транспорта
//            
//  ПараметрыРегистрации  - Структура - данные регитсрации
//               
//
Процедура СформироватьКомплектДокументовПриемкиИЗарегистрироватьУбытиеТранспорта(
	ДокументРегистрации, ПараметрыРегистрации) Экспорт
	 
	ПараметрыФормирования = ПараметрыФормированияКомплектаДокументов(
		ДокументРегистрации, ПараметрыРегистрации);
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьТаблицуДокументовПриемкиПоРегистрации(ДокументРегистрации);
		
		ТранспортныйДокумент = Документы.гкс_ТранспортныйДокумент.
			СформироватьТранспортныйДокументПоНеобходимости(ДокументРегистрации);
			
		Если ЗначениеЗаполнено(ТранспортныйДокумент) Тогда
			
			ПараметрыФормирования.Вставить("ТранспортныйДокумент", ТранспортныйДокумент);
			
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("ДокументРегистрации", ДокументРегистрации);
			СтруктураЗаписи.Вставить("ТранспортныйДокумент", ТранспортныйДокумент);
			СтруктураЗаписи.Вставить("ТранспортноеСредство", ПараметрыФормирования.ТранспортноеСредство);
			
			гкс_ПриемкаТранспорта.УстановитьСвязьРегистрацииИТранспортногоДокумента(СтруктураЗаписи);
			
		КонецЕсли;
		
		Документы.гкс_ОснованиеДляДвиженияЗапасов
			.СформироватьДокументПоНеобходимости(ДокументРегистрации, ПараметрыФормирования);
		
		гкс_ПриемкаТранспорта.ЗарегистрироватьНовоеСостояние(
			ДокументРегистрации, Перечисления.гкс_СостоянияРегистрации.Убыл);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Убытие транспорта'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

// Выполняет удаление связи регистрации и транспортного документа.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - документ регистрации транспорта
Процедура ВыполнитьУдалениеСвязиРегистрацииИТранспортногоДокумента(ДокументРегистрации) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		ЗаблокироватьТаблицуДокументовПриемкиПоРегистрации(ДокументРегистрации);
		гкс_ПриемкаТранспорта.УдалитьСвязьРегистрацииИТранспортногоДокумента(
			Новый Структура("ДокументРегистрации", ДокументРегистрации));
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Приемка транспорта'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСостоянияРегистрации(ДокументРегистрации)
	
	СостоянияРегистрации = Перечисления.гкс_СостоянияРегистрации.КачествоПринято;
	НаправлениеНаРазгрузкуСсылка = гкс_ПриемкаТранспорта.НаправлениеНаРазгрузкуПоРегистрации(ДокументРегистрации);

	Если ЗначениеЗаполнено(НаправлениеНаРазгрузкуСсылка) Тогда
		СостоянияРегистрации = Перечисления.гкс_СостоянияРегистрации.ВыгрузкаРазрешена;
	КонецЕсли;

	Возврат СостоянияРегистрации; 
	
КонецФункции

Процедура ЗаблокироватьТаблицуДокументовПриемкиПоРегистрации(ДокументРегистрации)
	
	Если Не ТранзакцияАктивна() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных();
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ДокументРегистрации", ДокументРегистрации);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры

#Область Печать

Функция ПечатьСкладскойРасписки(МассивОбъектов, ОбъектыПечати, ПараметрыПечати = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПодписантов = Неопределено;
	
	Если ПараметрыПечати <> Неопределено Тогда
		Если ПараметрыПечати.Свойство("СтруктураПодписантов") Тогда
			СтруктураПодписантов = ПараметрыПечати.СтруктураПодписантов;
		КонецЕсли;
	КонецЕсли; 
	
	ДанныеДляПечатиШапка = ВыбратьДанныеДляПечатиСкладскойРаспискиШапка(МассивОбъектов[0]);
	ДанныеДляПечатиТаблица = ВыбратьДанныеДляПечатиСкладскойРаспискиТаблица(МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_гкс_АРМПриемкаНаПЛК_ПФ_MXL_СкладскаяРасписка";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.гкс_ПриемкаТранспорта.ПФ_MXL_СкладскаяРасписка");
	
	СекцияШапка = Макет.ПолучитьОбласть("Шапка");
	Если ДанныеДляПечатиШапка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СекцияШапка.Параметры, ДанныеДляПечатиШапка);
		СекцияШапка.Параметры.ДатаРасписки = Формат(ДанныеДляПечатиШапка.ДатаРасписки, "ДФ=dd.MM.yyyy");
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(СекцияШапка);
	СекцияШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(СекцияШапкаТаблицы);
	
	ИтогВесНетто = 0;
	НомерПП = 0;
	Пока ДанныеДляПечатиТаблица.Следующий() Цикл
		СекцияСтрока = Макет.ПолучитьОбласть("Строка");
		НомерПП = НомерПП + 1;
		ЗаполнитьЗначенияСвойств(СекцияСтрока.Параметры, ДанныеДляПечатиТаблица);
		СекцияСтрока.Параметры.НомерПП = НомерПП;
		ИтогВесНетто = ИтогВесНетто + ДанныеДляПечатиТаблица.ВесНетто;
		ТабличныйДокумент.Вывести(СекцияСтрока);
	КонецЦикла;
	
	СекцияПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	СекцияПодвалТаблицы.Параметры.ВесНетто = ИтогВесНетто;
	ТабличныйДокумент.Вывести(СекцияПодвалТаблицы);
	СекцияПодвал = Макет.ПолучитьОбласть("Подвал");
	ЗаполнитьЗначенияСвойств(СекцияПодвал.Параметры, СтруктураПодписантов);
	ТабличныйДокумент.Вывести(СекцияПодвал);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ВыбратьДанныеДляПечатиСкладскойРаспискиШапка(СсылкаНаПервыйДокумент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБТ_ДвижениеЗапасов.Организация КАК Организация,
		|	ЦБТ_ДвижениеЗапасов.ПунктРазгрузки КАК Склад,
		|	НАЧАЛОПЕРИОДА(ЦБТ_ДвижениеЗапасов.Дата, ДЕНЬ) КАК ДатаРасписки,
		|	РегистрацияНаПЛК.Собственник КАК ВладелецГруза
		|ИЗ
		|	Документ.ЦБТ_ДвижениеЗапасов КАК ЦБТ_ДвижениеЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ПО ЦБТ_ДвижениеЗапасов.гкс_ДокументРегистрации = РегистрацияНаПЛК.Ссылка
		|ГДЕ
		|	ЦБТ_ДвижениеЗапасов.Ссылка = &СсылкаНаПервыйДокумент";
	
	Запрос.УстановитьПараметр("СсылкаНаПервыйДокумент", СсылкаНаПервыйДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
КонецФункции

Функция ВыбратьДанныеДляПечатиСкладскойРаспискиТаблица(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦБТ_ДвижениеЗапасов.Ссылка КАК ДвижениеЗапасов,
		|	ЦБТ_ДвижениеЗапасов.гкс_ДокументРегистрации КАК ДокументРегистрации
		|ПОМЕСТИТЬ ВТ_ДвиженияЗапасов
		|ИЗ
		|	Документ.ЦБТ_ДвижениеЗапасов КАК ЦБТ_ДвижениеЗапасов
		|ГДЕ
		|	ЦБТ_ДвижениеЗапасов.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДвиженияЗапасов.ДвижениеЗапасов КАК ДвижениеЗапасов,
		|	ВТ_ДвиженияЗапасов.ДокументРегистрации КАК ДокументРегистрации,
		|	МАКСИМУМ(ЕСТЬNULL(ВзвешиваниеБрутто.Ссылка, ЗНАЧЕНИЕ(Документ.гкс_Взвешивание.ПустаяСсылка))) КАК ДокументВзвешиваниеБрутто,
		|	МАКСИМУМ(ЕСТЬNULL(ВзвешиваниеТара.Ссылка, ЗНАЧЕНИЕ(Документ.гкс_Взвешивание.ПустаяСсылка))) КАК ДокументВзвешиваниеТары
		|ПОМЕСТИТЬ ВТ_Взвешивание
		|ИЗ
		|	ВТ_ДвиженияЗапасов КАК ВТ_ДвиженияЗапасов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеБрутто
		|		ПО ВТ_ДвиженияЗапасов.ДокументРегистрации = ВзвешиваниеБрутто.ДокументРегистрации
		|			И (ВзвешиваниеБрутто.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Въезд))
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеТара
		|		ПО ВТ_ДвиженияЗапасов.ДокументРегистрации = ВзвешиваниеТара.ДокументРегистрации
		|			И (ВзвешиваниеТара.ТипВзвешивания = ЗНАЧЕНИЕ(Перечисление.гкс_ТипыВзвешивания.Выезд))
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДвиженияЗапасов.ДвижениеЗапасов,
		|	ВТ_ДвиженияЗапасов.ДокументРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВзвешиваниеБрутто.Вес, 0) / 1000 КАК ВесБрутто,
		|	ЕСТЬNULL(ВзвешиваниеТара.Вес, 0) / 1000 КАК ВесТары,
		|	ЦБТ_ДвижениеЗапасовТовары.КоличествоРазгрузка КАК ВесНетто,
		|	ЦБТ_ДвижениеЗапасовТовары.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ЦБТ_ДвижениеЗапасовТовары.Номенклатура КАК Номенклатура,
		|	ЦБТ_ДвижениеЗапасовТовары.НомерТранспортногоСредства КАК ТранспортноеСредство,
		|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕСТЬNULL(ЦБТ_ТранспортныйДокумент.ПунктПогрузки, ЗНАЧЕНИЕ(Справочник.гкс_ТочкиМаршрута.ПустаяСсылка)) КАК СтанцияОтправления
		|ПОМЕСТИТЬ ВТ_Итог
		|ИЗ
		|	ВТ_Взвешивание КАК ВТ_Взвешивание
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЦБТ_ДвижениеЗапасов.Товары КАК ЦБТ_ДвижениеЗапасовТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|			ПО ЦБТ_ДвижениеЗапасовТовары.Номенклатура = СпрНоменклатура.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ТранспортныйДокумент КАК ЦБТ_ТранспортныйДокумент
		|			ПО ЦБТ_ДвижениеЗапасовТовары.ТранспортныйДокумент = ЦБТ_ТранспортныйДокумент.Ссылка
		|		ПО ВТ_Взвешивание.ДвижениеЗапасов = ЦБТ_ДвижениеЗапасовТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеБрутто
		|		ПО ВТ_Взвешивание.ДокументВзвешиваниеБрутто = ВзвешиваниеБрутто.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_Взвешивание КАК ВзвешиваниеТара
		|		ПО ВТ_Взвешивание.ДокументВзвешиваниеТары = ВзвешиваниеТара.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Итог.ВесБрутто КАК ВесБрутто,
		|	ВТ_Итог.ВесТары КАК ВесТары,
		|	ВТ_Итог.ВесНетто КАК ВесНетто,
		|	ВТ_Итог.ТранспортныйДокумент КАК ТранспортныйДокумент,
		|	ВТ_Итог.Номенклатура КАК Номенклатура,
		|	ВТ_Итог.ТранспортноеСредство КАК ТранспортноеСредство,
		|	ВТ_Итог.ЕдиницаИзмерения КАК ЕдИзм,
		|	гкс_ТочкиМаршрута.КодСтанцииЖД КАК СтанцияОтправления
		|ИЗ
		|	ВТ_Итог КАК ВТ_Итог
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК гкс_ТочкиМаршрута
		|		ПО ВТ_Итог.СтанцияОтправления = гкс_ТочкиМаршрута.Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;
	
КонецФункции

#КонецОбласти

Функция ПолучитьМестнуюДату(ТочкаМаршрута)
	
	ЧасовойПоясПЛК 	= гкс_ПриемкаТранспорта.ЧасовойПоясПЛК(ТочкаМаршрута);
	МестнаяДата 	= ТекущаяДатаСеанса();
	Если ЗначениеЗаполнено(ЧасовойПоясПЛК) Тогда
		МестнаяДата = МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПоясПЛК);
	КонецЕсли;
	
	Возврат МестнаяДата;
	
КонецФункции

Функция ПропускатьВходнойКонтроль(ДокументРегистрации)
	Возврат РегистрыСведений.гкс_ПриемкаТранспортаБезВходногоКонтроля
					.ПроверитьПриемкуТранспортаБезВходногоКонтроля(ДокументРегистрации);
КонецФункции

#Область ФормированиеКомплектаЗавершающихДокументовПоПриемке

Функция ПараметрыФормированияКомплектаДокументов(ДокументРегистрации, ПараметрыРегистрации)
	
	ПараметрыФормирования = ПараметрыФормированияКомплектаДокументовПоУмолчанию();
	
	ДанныеРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументРегистрации, 
	    "ТочкаМаршрута, ВидПеревозки, ТипРегистрации, Собственник, Организация, Внутригрупповой, Дата, Контрагент,
	    |НомерДокументаПоставщика, ДатаДокументаПоставщика, ТранспортноеСредство, Номенклатура,ВесНетто, Спецификация");
	
	ЗаполнитьЗначенияСвойств(ПараметрыФормирования, ДанныеРегистрации);
	
	ПараметрыФормирования.ДатаДокумента = ДанныеРегистрации.Дата;
	ПараметрыФормирования.Грузополучатель = ДанныеРегистрации.Организация;
	ПараметрыФормирования.ЭтоПриемка = 
		ДанныеРегистрации.ТипРегистрации = Перечисления.гкс_ТипРегистрации.Приемка;
	
	ПараметрыФормирования.Вставить("ЭтоАвтоперевозка", 
		ПараметрыФормирования.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.Автомобиль);
		
	ПараметрыФормирования.Вставить("ЭтоЖДперевозка", 
		ПараметрыФормирования.ВидПеревозки = Перечисления.гкс_ТипыТранспортныхСредствДоставки.ЖДТранспорт);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ПараметрыФормирования, ПараметрыРегистрации, Истина);
	
	// попытка найти уже принятый композитный анализ
	ПереопределитьЛабораторныйАнализ(ДокументРегистрации, ПараметрыФормирования);
	
	Возврат ПараметрыФормирования;
	
КонецФункции

Функция ПараметрыФормированияКомплектаДокументовПоУмолчанию()
		
	СтруктураПараметровПоУмолчанию = Новый Структура;
	СтруктураПараметровПоУмолчанию.Вставить("Дата");
	СтруктураПараметровПоУмолчанию.Вставить("Организация");
	СтруктураПараметровПоУмолчанию.Вставить("ТочкаМаршрута");
	СтруктураПараметровПоУмолчанию.Вставить("ВидПеревозки");
	СтруктураПараметровПоУмолчанию.Вставить("ТипРегистрации");
	СтруктураПараметровПоУмолчанию.Вставить("Собственник");
	СтруктураПараметровПоУмолчанию.Вставить("Грузополучатель");
	СтруктураПараметровПоУмолчанию.Вставить("Внутригрупповой");
	СтруктураПараметровПоУмолчанию.Вставить("ДатаДокумента");
	СтруктураПараметровПоУмолчанию.Вставить("Контрагент");
	СтруктураПараметровПоУмолчанию.Вставить("ФактическийСклад");
	СтруктураПараметровПоУмолчанию.Вставить("ЭтоПриемка");
	СтруктураПараметровПоУмолчанию.Вставить("НомерДокументаПоставщика");
	СтруктураПараметровПоУмолчанию.Вставить("ДатаДокументаПоставщика");
	СтруктураПараметровПоУмолчанию.Вставить("ТранспортноеСредство");
	СтруктураПараметровПоУмолчанию.Вставить("Номенклатура");
	СтруктураПараметровПоУмолчанию.Вставить("Спецификация");
	
	СтруктураПараметровПоУмолчанию.Вставить("ЛабораторныйАнализ");
	СтруктураПараметровПоУмолчанию.Вставить("ПунктРазгрузки");
	
	СтруктураПараметровПоУмолчанию.Вставить("ВесНетто");
	СтруктураПараметровПоУмолчанию.Вставить("ВесНеттоФакт");
	СтруктураПараметровПоУмолчанию.Вставить("ВесБрутто");
	СтруктураПараметровПоУмолчанию.Вставить("ВесБруттоФакт");
	СтруктураПараметровПоУмолчанию.Вставить("ВесТары");
	СтруктураПараметровПоУмолчанию.Вставить("ВесТарыФакт");
	
	Возврат СтруктураПараметровПоУмолчанию;
	
КонецФункции

Процедура ПереопределитьЛабораторныйАнализ(ДокументРегистрации, ПараметрыФормирования)
	
	// для режима отправки лаб. анализа входного контроля переопределять анализ не нужно 
	Если гкс_ПриемкаТранспорта.ПодходитДляОснованияДвиженияЗапасов(
		ПараметрыФормирования.ЛабораторныйАнализ) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛабораторныйАнализ.Ссылка КАК АнализСсылка
	|ПОМЕСТИТЬ ВТ_ПоФормированиюПроб
	|ИЗ
	|	Документ.гкс_ФормированиеНомераПробы.СписокРегистраций КАК ФормированиеНомераПробыСписокРегистраций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|		ПО ФормированиеНомераПробыСписокРегистраций.Ссылка = ЛабораторныйАнализ.гкс_ДокументРегистрации
	|			И (ЛабораторныйАнализ.Проведен)
	|			И (ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПриемкаКомпозит))
	|			И (ФормированиеНомераПробыСписокРегистраций.ДокументРегистрации = &ДокументРегистрацииНаПЛК)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛабораторныйАнализ.Ссылка КАК АнализСсылка
	|ПОМЕСТИТЬ ВТ_ПоРегистрации
	|ИЗ
	|	Документ.гкс_ЛабораторныйАнализ КАК ЛабораторныйАнализ
	|ГДЕ
	|	ЛабораторныйАнализ.Проведен
	|	И ЛабораторныйАнализ.гкс_НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПриемкаКомпозит)
	|	И ЛабораторныйАнализ.гкс_ДокументРегистрации = &ДокументРегистрацииНаПЛК
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПоРегистрации.АнализСсылка КАК КомпозитныйАнализ
	|ИЗ
	|	ВТ_ПоРегистрации КАК ВТ_ПоРегистрации
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ПоФормированиюПроб.АнализСсылка
	|ИЗ
	|	ВТ_ПоФормированиюПроб КАК ВТ_ПоФормированиюПроб";
	
	Запрос.УстановитьПараметр("ДокументРегистрацииНаПЛК", ДокументРегистрации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПараметрыФормирования.Вставить("ЛабораторныйАнализ", ВыборкаДетальныеЗаписи.КомпозитныйАнализ);
	КонецЦикла;
			
КонецПроцедуры	

#КонецОбласти

#Область ТекстыЗапросов

Функция ТекстЗапросаДанныеДляДетальныхЗаписей()
	
	Возврат 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Регистрация.Ссылка КАК Ссылка,
	|	Регистрация.ВерсияДанных КАК ВерсияДанных,
	|	Регистрация.ПометкаУдаления КАК ПометкаУдаления,
	|	Регистрация.ТипРегистрации КАК ТипРегистрации,
	|	Регистрация.Номер КАК Номер,
	|	Регистрация.Дата КАК ДатаРегистрации,
	|	Регистрация.Проведен КАК Проведен,
	|	Регистрация.ТранспортноеСредство КАК ТранспортноеСредство,
	|	Регистрация.Организация КАК Организация,
	|	Регистрация.ОтправительПолучатель КАК ОтправительПолучатель,
	|	Регистрация.Собственник КАК Собственник,
	|	Регистрация.Контрагент КАК Контрагент,
	|	Регистрация.Водитель КАК Водитель,
	|	Регистрация.Номенклатура КАК Номенклатура,
	|	Регистрация.НомерДокументаПоставщика КАК НомерТТН,
	|	Регистрация.ДатаДокументаПоставщика КАК ДатаДокументаПоставщика,
	|	Регистрация.ВесБрутто КАК ВесБруттоПоДокументам,
	|	Регистрация.ВесТары КАК ВесТарыПоДокументам,
	|	Регистрация.ВесНетто КАК ВесПоДокументам
	|ИЗ
	|	Документ.гкс_РегистрацияНаПЛК КАК Регистрация
	|ГДЕ
	|	Регистрация.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФактическиеПоказателиКачества.Показатель КАК Показатель,
	|	ФактическиеПоказателиКачества.Значение КАК Значение,
	|	ФактическиеПоказателиКачества.СоответствуетНормативу КАК СоответствуетНормативу,
	|	ЕСТЬNULL(КачественныеПоказателиАнализа.ОтклонениеОтБазиса, 0) КАК ОтклонениеОтБазиса,
	|	ЕСТЬNULL(КачественныеПоказателиАнализа.гкс_Примечание, """") КАК Примечание,
	|	ФактическиеПоказателиКачества.УсиленныйКонтроль КАК УсиленныйКонтроль,
	|	ФактическиеПоказателиКачества.ЭтоЗначениеВнешнейПробы КАК ЭтоЗначениеВнешнейПробы,
	|	ФактическиеПоказателиКачества.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ВЫБОР
	|		КОГДА
	|			ФактическиеПоказателиКачества.НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.Приемка)
	|			ТОГДА 1
	|		КОГДА
	|			ФактическиеПоказателиКачества.НазначениеИспользованияКачества = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПромежуточныйКомпозит)
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ПорядокГруппы
	|ИЗ
	|	РегистрСведений.гкс_ФактическиеПоказателиКачества КАК ФактическиеПоказателиКачества
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК КачественныеПоказателиАнализа
	|		ПО ФактическиеПоказателиКачества.Регистратор = КачественныеПоказателиАнализа.Ссылка
	|		И ФактическиеПоказателиКачества.Показатель = КачественныеПоказателиАнализа.Показатель
	|ГДЕ
	|	ФактическиеПоказателиКачества.РегистрацияНаПЛК = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокГруппы,
	|	НазначениеИспользованияКачества";
	
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
